import MyPhoto from '../photos/myphoto.jpg'
import '../css/MainPage.css'

const MainPage = () => {

    return(
        <div className='bg-container'>
            <h1 className='header1'>Вітаю!</h1>
            <div className='head-container'>
                <div className='main-add-inf'>
                    <img src={MyPhoto} alt="MyPhoto" className='my-photo' />
                    <h2>Контакти</h2>
                    <hr />
                    <p>E-Mail:<br/>a.shvedenko722@gmail.com</p>
                    <a href="tel:+380635773383" className='p-num'>Номер телефону<br/>+380635773383</a>
                    <p>Tg: @l3aton</p>
                    <h2>Освіта</h2>
                    <hr />
                    <h3>2011-2022</h3>
                    <h3>БСШ №5</h3>
                    <p>Закінчив середню освіту</p>
                    <h3>2022-2026</h3>
                    <h3>Державний торговельно-економічний університет</h3>
                    <p>Спеціальність 121 "інженерія програмного забезпечення"</p>
                    <h2>Навички</h2>
                    <hr />
                    <p>React</p>
                    <p>JavaScript</p>
                    <p>HTML</p>
                    <p>CSS</p>
                    <p>Figma</p>
                    <p>MS office</p>
                    <h2>Мови</h2>
                    <hr />
                    <p>Українська</p>
                    <p>Англійська</p>
                </div>
                <div className='main-text'>
                    <h1 className='header1'>Шведенко Олександр</h1>
                    <h2>Про мене</h2>
                    <h2>Я веб-розробник. Частину своїх робіт можна переглянути вище, а тут я хочу трохи розповісти про себе. Наразі я навчаюся в ДТЕУ за спеціальністю 121 «Інженерія програмного забезпечення» і вже закінчив третій курс.</h2>
                    <h2>Досвід роботи</h2>
                    <h3>Мені 20 років. Мій досвід роботи включає приблизно 2,5 роки в ресторанній сфері, зокрема у кальянній. За цей час я займав адміністративну посаду, де відповідав за навчання співробітників, контроль їх роботи та підвищення кваліфікації. Також я займався розширенням асортименту, комунікацією з постачальниками, контролем товарних запасів і організацією регулярних замовлень. Працював у трьох закладах одночасно, виконуючи ці обов’язки у кожному з них.
                    Паралельно я займався вивченням веб-розробки, зокрема працюю з бібліотекою React. Пройшов курси від ITGID, a саме HTML/CSS, JavaScript, React.</h3>
                </div>
            </div>
        </div>
    )
}
export default MainPage;